---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasurementType.NormalizedSegmentLength
enum: Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType.NormalizedSegmentLength

Normalized segment length.
 It is defined for curves with user defined bounds or natural bounds.
 It is measured as the fraction of the segment length over the total length of the curve.
 Its value varies between 0 and 1. 0 corresponds to the start and 1 corresponds to the end.